# 7. 데이터 선택(loc)
이름을 이용하여 원하는 row에서 원하는 col 선택

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx')
df

  Unnamed: 0   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0         1번  채치수  북산고  197   90   85  100  95  85      Python
1         2번  정대만  북산고  184   40   35   50  55  25        Java
2         3번  송태섭  북산고  168   80   75   70  80  75  Javascript
3         4번  서태웅  북산고  187   40   60   70  75  80         NaN
4         5번  강백호  북산고  188   15   20   10  35  10         NaN
5         6번  변덕규  능남고  202   80  100   95  85  80           C
6         7번  황태산  능남고  188   55   65   45  40  35      PYTHON
7         8번  윤대협  능남고  190  100   85   90  95  95          C#

In [2]:
df.loc[0] #index 0에 해당하는 모든 columns 데이터

Unnamed: 0        1번
이름               채치수
학교               북산고
키                197
국어                90
영어                85
수학               100
과학                95
사회                85
SW특기          Python
Name: 0, dtype: object

In [3]:
df.loc[1, '국어'] #index 1에 해당하는 국어데이터

40

In [4]:
df.loc[[1, 2], '영어'] #index 1,2에 해당하는 영어데이터

1    35
2    75
Name: 영어, dtype: int64

In [5]:
df.loc[[1,2], ['영어', '수학']] ##index 1,2에 해당하는 영어, 수학데이터

   영어  수학
1  35  50
2  75  70

In [9]:
df.loc[1:5, '영어':'사회'] #인덱스 1부터 5까지, 컬럼 국어부터 사회까지 데이터

    영어  수학  과학  사회
1   35  50  55  25
2   75  70  80  75
3   60  70  75  80
4   20  10  35  10
5  100  95  85  80